import { useState } from "react";
import Blogcard from "../Blogcard/Blogcard";



const Blogdetailcard=(props)=>{
    const [relatedblog, setrelatedblog] = useState({
        data: [
            ["https://cdn-thra.bama.ir/uploads/BamaImages/News/1f96ec13-d265-4c96-9ce8-1869986d0175/article_638720262695632127.jpg?width=290", "هوندا کلیک 160 در برابر یاماها", "مقایسه اسکوترهای پرطرفدار ژاپنی", "3 روز پیش",],
            ["https://cdn-thra.bama.ir/uploads/BamaImages/News/9ac16201-c6ef-4a77-a4bb-5ea9ad5f6b09/article_638713280069004133.jpg?width=290", "بهترین موتورهای اسکوتر برای مبتدیان", "یاماها، اس‌وای‌ام یا تی‌وی‌اس؟", "1 روز پیش",],
            ["https://cdn-thra.bama.ir/uploads/BamaImages/News/04592d5e-a10e-4831-9aaa-ae1b862ddb5b/article_638602651201782347.jpg?width=290", "اخبار فرسودگی موتورسیکلت (1403)", "آغاز ثبت‌نام رایگان برای نوسازی موتورسیکلت‌های فرسوده", "2 روز پیش",],
        ]
    })


    return (
        <div className="mx-10 sm:mx-20 md:mx-28 lg:mx-40 xl:mx-56 mt-14">
            <div className="relative mb-10 sm:mb-20">
                <img className="w-full" src={props.img} alt="blog-img" />
                <div className="absolute top-0 w-full h-full bg-black bg-opacity-50"></div>
                <div className="absolute bottom-3 right-3 sm:bottom-12 sm:right-12 ">
                    <p className="text-white hidden sm:block text-[12px] sm:text-[14px] lg:text-[16px] mb-1">
                       {props.describ}
                    </p>
                    <h2 className="text-white text-[14px] sm:text-[18px] lg:text-[22px] mb-1 sm:mb-3">
                        {props.title}
                    </h2>
                    <span className="text-white text-[10px] sm:text-[12px] lg:text-[14px]">{props.date}</span>
                </div>
            </div>
            <div>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت .
                </p>
                <h4 className="text-[16px] sm:text-[18px] font-bold mb-4">
                {props.title}
                </h4>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                </p>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد
                </p>
                <div>
                    <img className="w-full mb-8 mt-5" src="https://cdn-thra.bama.ir/uploads/BamaImages/News/9ac16201-c6ef-4a77-a4bb-5ea9ad5f6b09/Content/FotoJet - 2024-12-30T184819.078638711814038841700.jpg" alt="blog-img" />
                </div>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد
                </p>
                <h4 className="text-[16px] sm:text-[18px] font-bold mb-4">
                {props.title}
                </h4>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد
                </p>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد
                </p>
                <p className="text-[14px] mb-7 text-justify lg:text-start">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد
                </p>
            </div>
            <div>
                <h3 className="text-[20px] font-bold mb-6">
                    مطالب مرتبط
                </h3>
                <div className="grid grid-cols-1 md:grid-cols-3 gap-6 mb-36">
                    {relatedblog.data.map((item) => (
                        <Blogcard img={item[0]} title={item[1]} describ={item[2]} date={item[3]} />
                    ))}
                </div>
            </div>
        </div>
    )
}

export default Blogdetailcard